<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"ce5e8e6504f7adc1337fc8c8f6b5011891807fca7611ffc23efb17154193c1b1","plan_job_ref":"Job terraform-plan-05-aws-complete #74 at https://github.com/pipetail/terraform/actions/runs/5403738856","plan_hash":"157a68708f444962dc5943f1cfb38837c2f654cd071abd98adcd6696deb5c379","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan in __examples/05-aws-complete__
<details>
<summary>Plan: 7 to add, 1 to change, 4 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.loki_storage will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "loki_storage" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "AllowLokiStorageChunksS3"
        }
    }

  # aws_iam_role_policy.loki_storage will be updated in-place
  ~ resource "aws_iam_role_policy" "loki_storage" {
        id     = "loki-ecs-task:loki-storage-access"
        name   = "loki-storage-access"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::complete-example-loki-storage/*",
                          - "arn:aws:s3:::complete-example-loki-storage",
                        ]
                      - Sid      = "AllowLokiStorageChunksS3"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket.loki will be destroyed
  # (because aws_s3_bucket.loki is not in configuration)
  - resource "aws_s3_bucket" "loki" {
      - arn                         = "arn:aws:s3:::complete-example-loki-storage" -> null
      - bucket                      = "complete-example-loki-storage" -> null
      - bucket_domain_name          = "complete-example-loki-storage.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "complete-example-loki-storage.s3.eu-west-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1BKCTXD74EZPE" -> null
      - id                          = "complete-example-loki-storage" -> null
      - object_lock_enabled         = false -> null
      - region                      = "eu-west-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - grant {
          - id          = "f6c9bb5b5f8c53cd4960ba75f4ed73205853f92823b077a3bee69258cdd5bcbe" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_public_access_block.loki will be destroyed
  # (because aws_s3_bucket_public_access_block.loki is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "loki" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "complete-example-loki-storage" -> null
      - id                      = "complete-example-loki-storage" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # aws_s3_bucket_server_side_encryption_configuration.loki will be destroyed
  # (because aws_s3_bucket_server_side_encryption_configuration.loki is not in configuration)
  - resource "aws_s3_bucket_server_side_encryption_configuration" "loki" {
      - bucket = "complete-example-loki-storage" -> null
      - id     = "complete-example-loki-storage" -> null

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
    }

  # aws_s3_bucket_versioning.loki will be destroyed
  # (because aws_s3_bucket_versioning.loki is not in configuration)
  - resource "aws_s3_bucket_versioning" "loki" {
      - bucket = "complete-example-loki-storage" -> null
      - id     = "complete-example-loki-storage" -> null

      - versioning_configuration {
          - status = "Enabled" -> null
        }
    }

  # module.loki_storage.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "complete-example-loki-data"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.loki_storage.aws_s3_bucket_acl.this[0] will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # module.loki_storage.aws_s3_bucket_ownership_controls.this[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.loki_storage.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.loki_storage.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.loki_storage.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Suspended"
        }
    }

  # module.eks.module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://A9EA85EEF3BEDAC3B8651C622B8FD7EA.gr7.eu-west-1.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvakNDQWVhZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJek1EWXlPREUyTkRNeE1sb1hEVE16TURZeU5URTJORE14TWxvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTkx6CmdXY3k1Vzh5Y0w3STAwdkNBT0d6dFdTS28wQUNVMkhhZlM3M0dhUWZUWE01TjZKdndpWnZYbVQwd002V2ZOWFEKMmtuYVMrYzFtV3NkdlJ1ZFl6VExyQWtBcm5jN0tuc2FYVkNjUTRjQXgrN2hlNE4rNUl6Q2s4bWFYeFNqYmhDeApWWGsyLy9TTkFVSlh2bHN4QmNhdEVyOXhocGllZmpINDJFeGwvaC84V3ZmR1gvMHpIVi9PR0tpaEphRVMwcHdDCnMwaCtFMGovNk02VzFOVkhubU8zb1EzTSt1OWxuem5TQ0R6cTFaYklHQzluN1BUMEI2N2xEMzRtT2xoVUZBcjIKUXlrVm54RXFTWmZYOHZhRloxV1htUVg2eVpSZnZuYW41SjZ0LzJLU3kySXJnUHBXTktBRDE3ZUhYa2Rpc1QzLwo5VWQrQ0ZtWlFTMTk0QkVjSzNrQ0F3RUFBYU5aTUZjd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZOa0N4V1RvQW1tdDdrOE91eC9tREFSNiszejdNQlVHQTFVZEVRUU8KTUF5Q0NtdDFZbVZ5Ym1WMFpYTXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnRUJBS0lVV3hqWXhxdHdhcm9DcDkrRApOQlNNNVMxYmpLQnRLK2xSNm9rWUtMWmtrbll2ZjU5ejVOaFRzMUt3dVdEcDlibDFzZ2gvb2xrREIyeDd0NjFHCkJNWWlUNEY1dHJNTmJLSkRLbm5Xb0plYzAwUENmbTRIQ0orK09ZMjJ6eG1RbDZqdjBXaXczaUI5WndNd2NGVVIKVmFrWHNkblk0VmV5bEJEQW83L0N6WTJ6ZEZKMFhweGxLeTk5eExMUXJtK2t0bVF3NGZxUlQ5cElTVEtDdlUvWQoxbkRpNW9CS215cG5wOVlhdENnaTFEMHpCL2FpbjNOckZnWEJQdkxETHZRR2pJcVNiK0xrWStCWHhTb2FqK1JrCjhSdXdyWGdMa1hQSmZZMHZ3Tnlqd0VBMGU4RlYwcUdrZWU2YVVNMnU3Zklra0NGQlc4d1VLRzdxNGRLbjZlWi8Kck5ZPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_complete-example-prod
            
            contexts:
            - context:
                cluster: eks_complete-example-prod
                user: eks_complete-example-prod
              name: eks_complete-example-prod
            
            current-context: eks_complete-example-prod
            
            users:
            - name: eks_complete-example-prod
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "complete-example-prod"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_complete-example-prod"
      + id                   = (known after apply)
    }

Plan: 7 to add, 1 to change, 4 to destroy.
```
</details>

:memo: Plan generated in [terraform-plan-05-aws-complete #74](https://github.com/pipetail/terraform/actions/runs/5403738856)